AriaSignature-Cfe/Catalogs/АС_КонтрагентыAria.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>АС_КонтрагентыAria</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПККонтрагента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПККонтрагентов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПККонтрагентаТЧ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АС_КомпьютерыAria</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодПК</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

AriaSignature-Cfe/Catalogs/АС_КомпьютерыAria.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>АС_КомпьютерыAria</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяПК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентПК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АС_КонтрагентыAria</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IPУстройства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

AriaSignature-Cfe/Catalogs/АС_КонтрагентыAria/Forms/ФормаЭлемента/Ext/Form/Module.bsl
//+BAS 23.05.2026 : Вывод на форму элемента данных о ПК контрагента
// Реализовать вывод ПК с ссылкой на соответствующий справочник в ТЧ

Функция ПолучитьДанныеПККонтрагента(Контрагент)
	ТаблицаПК = Новый ТаблицаЗначений;
	ТаблицаПК.Колонки.Добавить("СсылкаНаКомпьютер");
	ТаблицаПК.Колонки.Добавить("КодКомпьютера");
	
	Если Не ЗначениеЗаполнено(Контрагент) Тогда
		Возврат ТаблицаПК;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Компьютеры.Ссылка КАК СсылкаНаКомпьютер,
	|	Компьютеры.Код КАК КодКомпьютера
	|ИЗ
	|	Справочник.АС_КомпьютерыAria КАК Компьютеры
	|ГДЕ
	|	Компьютеры.КонтрагентПК = &Контрагент
	|	И Компьютеры.Активен = ИСТИНА
	|УПОРЯДОЧИТЬ ПО
	|	Компьютеры.Код";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаПК.Добавить();
		НоваяСтрока.СсылкаНаКомпьютер = Выборка.СсылкаНаКомпьютер;
		НоваяСтрока.КодКомпьютера = Выборка.КодКомпьютера;
	КонецЦикла;
	
	Возврат ТаблицаПК;
КонецФункции



&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьТаблицуПККонтрагентовНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуПККонтрагентовНаСервере()
	Объект.ПККонтрагентов.Очистить();
	
	ДанныеПК = ПолучитьДанныеПККонтрагента(Объект.Ссылка);
	Для Каждого СтрокаПК Из ДанныеПК Цикл
		НоваяСтрока = Объект.ПККонтрагентов.Добавить();
		НоваяСтрока.ИмяПККонтрагентаТЧ = СтрокаПК.СсылкаНаКомпьютер;
		НоваяСтрока.КодПК = СтрокаПК.КодКомпьютера;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ЗаполнитьТаблицуПККонтрагентовНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ИмяПККонтрагентаТЧВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено И ЗначениеЗаполнено(ТекущиеДанные.ИмяПККонтрагентаТЧ) Тогда
		ПоказатьЗначение(, ТекущиеДанные.ИмяПККонтрагентаТЧ);
	КонецЕсли;
КонецПроцедуры


//+BAS 23.05.2026 : Переход по двойному нажатию на строку ТЧ в форму элемента справочника

&НаКлиенте
Процедура ПККонтрагентовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
		СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено И ЗначениеЗаполнено(ТекущиеДанные.ИмяПККонтрагентаТЧ) Тогда
		ОткрытьЗначение(ТекущиеДанные.ИмяПККонтрагентаТЧ);
	КонецЕсли;
КонецПроцедуры

//-BAS 23.05.2026 : Переход по двойному нажатию на строку ТЧ в форму элемента справочника

//-BAS 23.05.2026 : Вывод на форму элемента данных о ПК контрагента
